[
{"title": "U Me Aur Hum (2008) - full transcript", "plot": "The first time Ajay saw Pia, she served him drinks. She affected him more than the alcohol, and he found true love. He was a leading psychiatrist, but she messed up his mind. The first time Pia saw Ajay, he had too much to drink. She watched him make a fool of himself, and was relieved when he passed out. She was a woman who followed her heart, but despite his claims of true love, she had made up her mind. Thus began the story of Ajay and Pia. A love story, that begins at sea. Ajay and Pia develop a strong and special bond. In each other, they find an anchor. They rush into marriage, despite the advice and failing relationships of their friends. But no marriages can be complete without problems, and Ajay and Pia have also have to face hurdles, some of which seem insurmountable.", "url": "https://subslikescript.com/movie/U_Me_Aur_Hum-1039995"},
{"title": "U Turn (2016) - full transcript", "plot": "Rachana, a young reporter, is dismayed at the number of illegal u-turns and resulting traffic accidents, and she wants to write a story about it. In pursuing a lead, she finds herself in the middle of a police case dealing with a series of murders. While freeing herself of false accusations, she becomes part of the investigation process. What is behind the mysterious deaths and how are they are all connected to the flyover road?", "url": "https://subslikescript.com/movie/U_Turn-5377564"},
{"title": "U-571 (2000) - full transcript", "plot": "In the midst of World War II, the battle below the seas rages. The Nazis have the upper edge as the Allies are unable to crack their war codes. That is, until a wrecked U-boat sends out an SOS signal, and the Allies realize this is their chance to seize the 'enigma coding machine'. But masquerading as Nazis and taking over the U-boat is the smallest of their problems. The action really begins when they get stranded on the U-boat.", "url": "https://subslikescript.com/movie/U-571-141926"},
{"title": "U Pana Boga za piecem (1998) - full transcript", "plot": null, "url": "https://subslikescript.com/movie/U_Pana_Boga_za_piecem-178031"},
{"title": "U Turn (2018) - full transcript", "plot": "The plot revolves around the death of motorists who break a traffic rule at a particular flyover in Hyderabad and the subsequent pinning down of the culprit by an intern journalist and police inspector duo.", "url": "https://subslikescript.com/movie/U_Turn-8733898"},
{"title": "U Turn (1997) - full transcript", "plot": "When Bobby's car breaks down in the desert while on the run from some of the bookies who have already taken two of his fingers, he becomes trapped in the nearby small town where the people are stranger than anyone he's encountered. After becoming involved with a (unbeknownst to him) young married woman, her husband hires Bobby to kill her. Later, she hires Bobby to kill the husband.", "url": "https://subslikescript.com/movie/U_Turn-120399"},
{"title": "U ozera (1970) - full transcript", "plot": null, "url": "https://subslikescript.com/movie/U_ozera-65140"},
{"title": "U14 (2020) - full transcript", "plot": "A late-night radio DJ is bombarded with calls all making the same ominous request.", "url": "https://subslikescript.com/movie/U14-11708964"},
{"title": "U.S. Seals II (2001) - full transcript", "plot": "Lieutenant Casey Sheppard, US SEAL, (Michael Worth) takes exception to the useless brutality of his chief Frank Ratliffe (Damian Chapa), during a search and destroy mission. Later, back to their army base in Okinawa Island, Japan, it's obvious they are interested in Sensei Matsumura's (George Cheung) twin daughters, the daring Nikki (Karen Kim) and the coy Kamiko (Karen Kim in a double role). Frank goes on a date with Nikki and sometime later Casey finds her corpse, and sees Frank in the process of hiding evidence of a murder-for-rape crime. Three years later, Frank Ratliffe is a criminal operating from a former Russian island, who has turned against his own SEAL corps and about to kidnap Dr. Jane Burrows (Kate Connor), a physicist scientist, to force her help him getting two nuclear bombs ready for a strike against the United States. Backed by an army of dozens of killers, plus Sophia (Sophia Crawford), a sexy expert with the saber, and Borris (Velizar Binev) the scarf strangler, he asks for one billion dollars ransom for the bomb. His former commander Admiral (Burnell Tucker) forms a team of seven commandos, including retired SEALs like Frank's arch-rival Casey, Army Major Nathan Doner (Marshall R. Teague), and Kamiko who, reluctant at first, then accepts to help Casey in what is deemed to be a high risk, desperate mission against powerful, evil terrorists. After the invasion, as any explosives or gun shots would ignite the natural gas that contaminated the nuclear station, the seven commandos and the defending thugs are restricted to the use of crossbows, swords, daggers, iron chains, and hand-to-hand fighting techniques which in the end will prove to be as deadly as machine-guns. When action stops, it's a gory end for all, and a Pyrrhic victory for a few.", "url": "https://subslikescript.com/movie/US_Seals_II-283652"},
{"title": "U Turn (2020) - full transcript", "plot": "U turn tells the story of a budding investigator and a cop who will uncover the new conspiracies of a bike gang.", "url": "https://subslikescript.com/movie/U_Turn-11638656"},
{"title": "U2: Rattle and Hum (1988) - full transcript", "plot": "This film documents the 1987 North American tour of the great rock band U2. Fresh with their success of their best selling album \"The Joshua Tree\", the band plays monster gigs. Along the way, the band takes the opportunity to indulge in some special musical activities like playing with B.B. King and performing \"I Still Haven't Found What I'm Looking\" with a famous church choir. All the while, concert footage of the band's biggest hits on tour are featured while Bono speaks his mind on the problems of his homeland.", "url": "https://subslikescript.com/movie/U2_Rattle_and_Hum-96328"},
{"title": "U.S. Seals (2000) - full transcript", "plot": "Dozens of American cargos with high valuable goods have disappeared, probably attacked by modern pirates. The United States decide to mobilize a team of expert SWAT, with Mike Bradley as ...", "url": "https://subslikescript.com/movie/US_Seals-195366"},
{"title": "Ukigusa no yado (1957) - full transcript", "plot": null, "url": "https://subslikescript.com/movie/Ukigusa_no_yado-51123"},
{"title": "U311 Cherkasy (2019) - full transcript", "plot": "The crew of Ukrainian NAVY minesweeper U311 \"Cherkasy\" is resisting seizure of the vessel by Russian army in Crimea in 2014.", "url": "https://subslikescript.com/movie/U311_Cherkasy-8205656"},
{"title": "Udaan (2010) - full transcript", "plot": "After being abandoned for eight straight years in boarding school, Rohan returns to the small industrial town of Jamshedpur and finds himself closeted with an authoritarian father and a younger half brother who he didn't even know existed. Forced to work in his father's steel factory and study engineering against his wishes, he strives to forge his own life out of his given circumstances and pursue his dream of being a writer.", "url": "https://subslikescript.com/movie/Udaan-1639426"},
{"title": "Ubit drakona (1989) - full transcript", "plot": "Dragon is a bloody dictator, who kills every opponent. People live hopelessly, until Lancelot comes to save the beautiful Elsa. Lancelot can only win, if all people become free from fear, that is feeding the Dragon's power. Dragon's multiple personalities, ranging from a \"dragon\" to a \"samurai\" to a \"Nazi\", scare the hell out of all people, except Lancelot. Finally Dragon drops all his masks, to become the most dangerous of his incarnations - \"himself\". And the battle begins.", "url": "https://subslikescript.com/movie/Ubit_drakona-96329"},
{"title": "Uchuu Senkan Yamato 2202: Ai no Senshitachi (2017) - full transcript", "plot": "The continuing adventures of the space battleship Yamato.", "url": "https://subslikescript.com/movie/Uchuu_Senkan_Yamato_2202_Ai_no_Senshitachi-5592004"},
{"title": "Ujala Hi Ujala (1974) - full transcript", "plot": "Anuradha lost her mother at a very young age, and her father re-married a much younger woman named Anita, who wanted Anuradha out of their lives, and forced her to drink alcohol at a very young age. By the time Anuradha was an adult she was addicted to alcohol. After the passing of her dad, she is left to run a huge estate and business single-handedly - with the assistance of her close friend, Ajit and uncle, Jamunaprasad. One day Jamunaprasad recommends Vikram for employment with her organization, she does hire him, but dislikes him a lot. When Vikram comes to her rescue, the dislike turns into love, both want to get married, and she even gives up drinking. On the day of the engagement, Ajit cautions her against Vikram and shows her some incriminating photographs of Vikram and a woman named Gita. Angered at this betrayal, she immediately cancels her engagement and decides not to have to do anything with Vikram anymore. She takes to drinking alcohol again, and decides to marry Ajit. When Jamunaprasad wants to find out the reason, she accuses him of using Vikram to conspire against her and her wealth - as she will not let anyone come between her and Ajit anymore. What she does not know is that Ajit is already married; and is also having an affair with her step-mother. Will she find out about this, before it gets too late?", "url": "https://subslikescript.com/movie/Ujala_Hi_Ujala-374304"},
{"title": "Ujda Chaman (2019) - full transcript", "plot": "Chaman Kohli is 30 -year-old bachelor with Premature Balding and in quest of a beautiful wife. Chaman hits rock bottom when an astrologer gives him a deadline to find himself a wife or remain a celibate forever.", "url": "https://subslikescript.com/movie/Ujda_Chaman-11046300"},
{"title": "Ugly Duckling (1957) - full transcript", "plot": "Every family has its beauties.", "url": "https://subslikescript.com/movie/Ugly_Duckling-1074964"},
{"title": "UglyDolls (2019) - full transcript", "plot": "An animated adventure in which the free-spirited UglyDolls confront what it means to be different, struggle with a desire to be loved, and ultimately discover who you truly are is what matters most.", "url": "https://subslikescript.com/movie/UglyDolls-1946502"},
{"title": "Ujala (1959) - full transcript", "plot": "Bombay-based Ramu lives an impoverished lifestyle in a Chawl in Parel along with his widowed mother; sister Sandhya; & three much younger siblings, and makes a living using a wooden pushcart. One day his sister, Munni, is run over by a car, gets hospitalized and passes away. Unable to obtain wood for her cremation, he uses his pushcart, and then joins hands with a Chembur-based gangster, Kalu, and picks pockets. He is able to get some money to feed the family as well as pay for Sandhya's engagement. He then gets into an altercation with one of his associates, Chandu, and the latter gets killed. Guilt-ridden he decides to give up on crime and gets a job sharpening knives. It is is here he will be plagued by the arrival of the police who are investigating Chandu's death - as well as become a suspect when a silver knife goes missing.", "url": "https://subslikescript.com/movie/Ujala-157132"},
{"title": "Ugetsu (1953) - full transcript", "plot": "In the beginning of the springtime in the period of the Japanese Civil Wars of the Sixteenth Century in Lake Biwa in the Province of Omi, the family man farmer and craftsman Genjurô travels to Nagahama to sell his wares and makes a small fortune. His neighbor Tobei that is a fool man dreams on becoming a samurai, but he can not afford to buy the necessary outfit. The greedy Genjurô and Tobei work together manufacturing clay potteries, expecting to sell the pieces and enrich; however, their wives Miyage and Ohama are worried about the army of the cruel Shibata that is coming to their village and they warn their ambitious husbands. Their village is looted but the families flee and survive; Genjurô and Tobei decide to travel by boat with their wives and baby to sell the wares in a bigger town. When they meet another boat that was attacked by pirates, Genjurô decides to leave his wife and son on the bank of the river, promising to return in ten days. Genjurô, Tobei and Ohama raise a large amount but Tobei leaves his wife to buy the samurai outfit and seek fame and fortune. Meanwhile the female aristocratic Lady Wakasa and her servant ask Genjurô to bring her shopping to her fancy Kutsuki House. Sooner Genjurô and Tobei discover the price they have to pay for their ambition.", "url": "https://subslikescript.com/movie/Ugetsu-46478"},
{"title": "UFO Conspiracies: The Hidden Truth (2020) - full transcript", "plot": "UFO Conspiracies : The Hidden Truth charts the US government's involvement with UFO phenomenon from 1947 to the present day. Featuring rare classified footage, expert interviews, images and recordings it uncovers the investigation...", "url": "https://subslikescript.com/movie/UFO_Conspiracies_The_Hidden_Truth-12567084"},
{"title": "UFO Journals (1978) - full transcript", "plot": "A documentary exploring the existence of extra-terrestrials.", "url": "https://subslikescript.com/movie/UFO_Journals-234935"},
{"title": "Ugly, Dirty and Bad (1976) - full transcript", "plot": "Four generations of a family live crowded together in a cardboard shantytown shack in the squalor of inner-city Rome. They plan to murder each other with poisoned dinners, arson, etc. The household engages in various forms of sexual idiosyncrasies, land swindles, incest, drugs and adultery.", "url": "https://subslikescript.com/movie/Ugly_Dirty_and_Bad-74252"},
{"title": "UFO (2018) - full transcript", "plot": "A college student, who sees a UFO, uses his exceptional math skills to investigate the sighting with his friends while the FBI follows closely behind.", "url": "https://subslikescript.com/movie/UFO-6290798"},
{"title": "UFO Chronicles: What the President Doesn't Know (2013) - full transcript", "plot": "Dr. Steven Greer, Founder and Director of the Disclosure Project and Project Orion, speaks frankly about his compilation of over 400 government, military and intelligence witnesses testifying to their direct, firsthand experience with UFOs, ET technology, and the cover-up and/or suppression of evidence of an Alien presence on earth. Commander Graham Bethune, a Navy Pilot who has extensively documented an eight minute encounter with an \"Unidentified Flying Object\" that was 300 feet in diameter, discusses this mind blowing encounter and many others experienced by pilots and air traffic controllers around the globe. Jim Marrs is a New York Times best-selling author of books and articles on a wide range of alleged cover-ups and conspiracies. Mr. Marrs is a prominent figure in the JFK conspiracy press and his book \"Crossfire\" was a source for Oliver Stone's film \"JFK.\" He has written books asserting the existence of government conspiracies regarding aliens, 9/11, telepathy, and secret societies. In this frank interview, Marrs reveals the true nature to the conspiracy of control by the ruling elite.", "url": "https://subslikescript.com/movie/UFO_Chronicles_What_the_President_Doesnt_Know-2778348"},
{"title": "UFO (2022) - full transcript", "plot": "Are you ready to watch a love story full of adrenaline? Ese, a biker who wants to be the regional champion, and Deniz, who believes that she'll be taken away from the world by the UFOs one day, are two teenagers living totally different lives in Adana. With their youthful thrill, Deniz and Ese fall in love with one another. This great love brings two different worlds together. Ese will get prepared for the final race with the help of his love for Deniz, and she will discover her reality, thanks to the passion in his eyes. And nothing will be the same in their lives ever again. No matter the cost.", "url": "https://subslikescript.com/movie/UFO-14369286"},
{"title": "Udumb (2021) - full transcript", "plot": "The events that happen in the life of Ani after he gets convicted for a murder.", "url": "https://subslikescript.com/movie/Udumb-13624868"},
{"title": "Ukiyoe zankoku monogatari (1968) - full transcript", "plot": null, "url": "http://subslikescript.com/movie/Ukiyoe_zankoku_monogatari-204705"},
{"title": "Ulidavaru Kandanthe (2014) - full transcript", "plot": "Malpe is a small fishing town on the Arabian Coast, located 6 kilometers to the west of the temple town of Udupi. Malpe's beaches are washed clean everyday by the sea. The waves ensure that nothing gets left behind on the sands. But then, the waves cannot reach everything. It is the time of the year when Udupi and its surroundings are decked up to celebrate Sri Krishna Janmaashtami (The Birth of Lord Krishna). Men and children walk the streets dressed up as characters from mythology. Teams painted as tigers are seen dancing to drum beats all around the town. But violence seems to be brewing in Malpe this Krishna Janmaashtami and it is going change the lives of the ones' involved forever.", "url": "http://subslikescript.com/movie/Ulidavaru_Kandanthe-3394420"},
{"title": "Ukraine on Fire (2016) - full transcript", "plot": "Ukraine. Across its eastern border is Russia and to its west-Europe. For centuries, it has been at the center of a tug-of-war between powers seeking to control its rich lands and access to the Black Sea. 2014's Maidan Massacre triggered a bloody uprising that ousted president Viktor Yanukovych and painted Russia as the perpetrator by Western media. But was it? \"Ukraine on Fire\" by Igor Lopatonok provides a historical perspective for the deep divisions in the region which lead to the 2004 Orange Revolution, 2014 uprisings, and the violent overthrow of democratically elected Yanukovych. Covered by Western media as a people's revolution, it was in fact a coup d'état scripted and staged by nationalist groups and the U.S. State Department. Investigative journalist Robert Parry reveals how U.S.-funded political NGOs and media companies have emerged since the 80s replacing the CIA in promoting America's geopolitical agenda abroad.", "url": "http://subslikescript.com/movie/Ukraine_on_Fire-5724358"},
{"title": "Ular Tangga (2017) - full transcript", "plot": "An indigo student who can see something bad is going to happen who come through a dream with her plan and friends for hiking a mountain but no one believe her.", "url": "http://subslikescript.com/movie/Ular_Tangga-5742836"},
{"title": "Ullasam (2022) - full transcript", "plot": "A fun-filled romantic movie in which two strangers from diverse backgrounds meet on a journey from Ooty to Kerala. The journey advances through different circumstances and coming across new people.", "url": "http://subslikescript.com/movie/Ullasam-10673868"},
{"title": "Ultimate Heist (2009) - full transcript", "plot": "The Malakian clan, a family of ruthless gangsters, controls the underworld of Southern France. At its head, the violent godfather Milo Malakian rules his world with an iron fist. His son and heir, Anton, dreams of breaking free and making his own choices. But the gang's inner circle is engraved in blood. To escape, not only does Anton have to counter his own destiny, but also the man who has sworn to bring his father down.", "url": "http://subslikescript.com/movie/Ultimate_Heist-1130993"},
{"title": "Ukraine: From Democracy to Chaos (2012) - full transcript", "plot": null, "url": "http://subslikescript.com/movie/Ukraine_From_Democracy_to_Chaos-3346230"},
{"title": "Ultimate Betrayal (1994) - full transcript", "plot": "This is based on a true story about two sisters who sue their father for incest and child abuse. As the story unfolds, it is revealed that the father severely abused all six children, and committed incest with all four of his daughters. The two sons received the worst of the physical abuse. The mother stood haplessly by and allowed her husband to control the family through his methods of \"discipline\". The movie includes graphic descriptions and scenes of the abuse which are disturbing.", "url": "http://subslikescript.com/movie/Ultimate_Betrayal-111539"},
{"title": "Ulan (2019) - full transcript", "plot": "Maya (Lustre) is a girl who has always held a pessimistic view of the rain, reminding her of failed love and other depressing things. Will the rain ever stop her in her journey to overcome past heartaches?", "url": "http://subslikescript.com/movie/Ulan-9653184"},
{"title": "Uljhan (1975) - full transcript", "plot": "Police Inspector Anand (Sanjeev Kumar) and Karuna (Sulakshana Pandit) are in love. They meet with the approval of their elders, and are married. Shortly after the marriage, there is a homicide, and the clues point toward Karuna. Anand disbelieves these, but noticing a change in Karuna, starts to actively pursue these clues. The rest of the family, including Anand's dad, a Judge by profession, side with the daughter-in-law, and Anand is left to pursue this against his family's wishes.", "url": "http://subslikescript.com/movie/Uljhan-230913"},
{"title": "Ultimate Zombie Feast (2020) - full transcript", "plot": "Zombie horror entertainment from around the world with this collection of more than 2 hours of gory tales of the undead. Thrills, chills and gut spills galore, plenty for any zombie fan to ...", "url": "http://subslikescript.com/movie/Ultimate_Zombie_Feast-12387302"},
{"title": "Ultraman Cosmos vs. Ultraman Justice: The Final Battle (2003) - full transcript", "plot": "Once again, Musashi has encounter Ultraman Cosmos. Now Ultraman Cosmos has gained some new modes to defeat Scropis. Musashi has joined Team Sea to save the Blue Area. But there is mysterious evil monster, Sandros, who wants to destroy the Earth. Now it is up Musashi and Ultraman Cosmos to defeat Sandros and who's the other Ultraman?", "url": "http://subslikescript.com/movie/Ultraman_Cosmos_vs_Ultraman_Justice_The_Final_Battle-2243192"},
{"title": "Ulta (2019) - full transcript", "plot": "Story of a fictional town called Ponnapuram, where all the women are self-sufficient and trained to handle any situation. Their world is put to the test when a few men decide to take them down.", "url": "http://subslikescript.com/movie/Ulta-9008968"},
{"title": "Ulysses' Gaze (1995) - full transcript", "plot": "A, a Greek filmmaker living in exile in the United States, returns to his native Ptolemas to attend a special screening of one of his extremely controversial films. But A's real interest lies elsewhere--the mythical reels of the very first film shot by the Manakia brothers, who, at the dawn of the age of cinema, tirelessly criss-crossed the Balkans and, without regard for national and ethnic strife, recorded the region's history and customs. Did these primitive, never-developed images really exist? If so, where are they? - \"Why A? It's an alphabetical choice. Every filmmaker remembers the first time he looked through the viewfinder of a camera. It is a moment that is not so much the discovery of cinema--but the discovery of the world. But there comes a moment when the filmmaker begins to doubt his own capacity to see things, when he no longer knows if his gaze is right and innocent.\" --Theo Angelopoulos", "url": "http://subslikescript.com/movie/Ulysses_Gaze-114863"},
{"title": "Um Ano Inesquecível - Outono (2023) - full transcript", "plot": null, "url": "http://subslikescript.com/movie/Um_Ano_Inesquecvel_-_Outono-27856735"},
{"title": "Ulzana's Raid (1972) - full transcript", "plot": "Report reaches the US cavalry that the Apache leader Ulzana has left his reservation with a band of followers. A compassionate young officer, Lieutenant DeBuin, is given a small company to find him and bring him back; accompanying the troop is McIntosh, an experienced scout, and Ke-Ni-Tay, an Apache guide. Ulzana massacres, rapes and loots across the countryside; and as DeBuin encounters the remains of his victims, he is compelled to learn from McIntosh and to confront his own naiveté and hidden prejudice.", "url": "http://subslikescript.com/movie/Ulzanas_Raid-69436"},
{"title": "Ulysses: A Dark Odyssey (2018) - full transcript", "plot": "United States of Europe is established 2020. Back from war in the Middle East, amnesiac Ulysses goes thru a lot in Taurus City, a dictatorship, looking for his wife, Penelope.", "url": "http://subslikescript.com/movie/Ulysses_A_Dark_Odyssey-5581752"},
{"title": "Ulysses & Mona (2018) - full transcript", "plot": "Ulysses, a secluded artist who mysteriously retired a few years ago, meets Mona, a young art student full of life. The encounter will change them both.", "url": "http://subslikescript.com/movie/Ulysses__Mona-8649636"},
{"title": "Ulysses (1967) - full transcript", "plot": "Dublin; June 16, 1904. Stephen Dedalus, who fancies himself as a poet, embarks on a day of wandering about the city during which he finds friendship and a father figure in Leopold Bloom, a middle-aged Jew. Meanwhile, Bloom's day, illuminated by a funeral and an evening of drinking and revelry that stirs paternal feelings toward Stephen, ends with a rapprochement with Molly, his earthy wife.", "url": "http://subslikescript.com/movie/Ulysses-62414"},
{"title": "Ulysse (1983) - full transcript", "plot": "Agnès Varda interviews two subjects from a photograph she took 30 years earlier.", "url": "http://subslikescript.com/movie/Ulysse-161034"},
{"title": "Ulvetid (1981) - full transcript", "plot": "Anna and Tom live in a remote place while Anna suffers from depression after an abortion, and is afraid of losing Tom's affection. An admirer of Tom's writing, Ellinor, adds to the problem, when she appears with a tame wolf.", "url": "http://subslikescript.com/movie/Ulvetid-122772"},
{"title": "Ultraviolet (2006) - full transcript", "plot": "Set in the late 21st century, a subculture of humans have emerged who have been modified genetically by a vampire-like disease, giving them enhanced speed, incredible stamina and acute intelligence, and as they are set apart from \"normal\" and \"healthy\" humans, the world is pushed to the brink of worldwide civil war aimed at the destruction of the \"diseased\" population. In the middle of this crossed-fire is - an infected beautiful woman - Ultraviolet, who finds herself protecting a nine-year-old boy who has been marked for death by the human government as he is believed to be a threat to humans.", "url": "http://subslikescript.com/movie/Ultraviolet-370032"},
{"title": "Ultrasuede: In Search of Halston (2010) - full transcript", "plot": "An exploration of the clothes, the glamour and the decadence of iconic fashion designer Halston.", "url": "http://subslikescript.com/movie/Ultrasuede_In_Search_of_Halston-1422786"},
{"title": "Ultrasound (2021) - full transcript", "plot": "After his car breaks down, Glen spends one hell of an odd night with a married couple, setting into motion a chain of events that alter their lives plus those of several random strangers.", "url": "http://subslikescript.com/movie/Ultrasound-12989912"},
{"title": "Ultrasonic (2012) - full transcript", "plot": "A musician with hyper-sensitive hearing goes in search of an ominous sound that plagues him, but is inaudible to everyone else.", "url": "http://subslikescript.com/movie/Ultrasonic-2070883"},
{"title": "Ulysses (1954) - full transcript", "plot": "In the ancient Greek city of Ithaca, many impatiently await the return of their king Ulysses and his warriors from the Trojan War. Among these, Ulysses' devoted wife Penelope and his grown son Telemachus. But Ulysses' return is not eagerly awaited by everyone, especially by his enemies. They openly court Penelope and ask her to give her husband up for dead and re-marry one of the rowdy suitors who have taken up residence in her home since her husband's departure. However, Penelope clings to her belief that Ulysses will soon return. To appease the aggressive suitors, Penelope promises that she would re-marry as soon as she finishes weaving a large tapestry depicting Ulysses' deeds of bravery. In secret, she's unraveling the day's weaving, thus delaying the tapestry's completion. Penelope knows that her trick won't work forever. In Troy, Ulysses and his warriors use the Trojan Horse ruse to conquer the city. In his fervor, Ulysses destroys the Trojans' temple to Neptune, god of the sea, incurring the ire of the witch Cassandra who curses him to suffer the wrath of Neptune. On the return home to Ithaca, Ulysses' boat shipwrecks and he's found unconscious on a Phaeacian island beach by beautiful princess Nausicaa. His long, arduous, treacherous and perilous odyssey begins.", "url": "http://subslikescript.com/movie/Ulysses-47630"},
{"title": "Ultramarines: A Warhammer 40,000 Movie (2010) - full transcript", "plot": "A squad of Ultramarines answer a distress call from an Imperial Shrine World. A full Company of Imperial Fists was stationed there, but there is no answer from them. The squad investigates to find out what has happened there.", "url": "http://subslikescript.com/movie/Ultramarines_A_Warhammer_40000_Movie-1679332"},
{"title": "Ultras (2020) - full transcript", "plot": "Naples. At almost fifty years old Sandro is the leader of the Apache, a group of ultras with whom he has spent his whole life at the stadium: a life of violence, clashes, passions, and ...", "url": "http://subslikescript.com/movie/Ultras-10937434"},
{"title": "Ultraman Ginga S Movie Showdown! The 10 Ultra Brothers! (2015) - full transcript", "plot": "In ULTRAMAN GINGA S THE MOVIE, a sinister space warrior, Etelgar, forces a beautiful young alien princess, Alena, to use her magical mirror to trap every Ultraman hero in the Galaxy! In order to stop Etelgar and save the princess and their fellow Ultramen, two young men, Hikaru and Shou, must each transform into new Ultra-heroes, Ultraman Ginga and Ultraman Victory, and combine their super-powers! Thus begins an epic battle of the greatest Ultraman heroes teaming up to defeat Etelgar and his army of villainous space warriors!", "url": "http://subslikescript.com/movie/Ultraman_Ginga_S_Movie_Showdown_The_10_Ultra_Brothers-4265568"},
{"title": "Ultraman Decker Preview Special (2022) - full transcript", "plot": "Introducing the passionate young man Kanata Asumi, who takes a stand when the world is put in danger by mysterious invaders, and the members of the defense force GUTS-Select that stand with him to fight against monsters", "url": "http://subslikescript.com/movie/Ultraman_Decker_Preview_Special-21243140"},
{"title": "Un gioco per Eveline (1971) - full transcript", "plot": "A couple on holiday travels around Corsica. There's some tension between them because Pierre wants Natalie to have his child. They stay at another couple's house and are joined by the disturbing appearance of a girl.", "url": "http://subslikescript.com/movie/Un_gioco_per_Eveline-122506"},
{"title": "Un etaj mai jos (2015) - full transcript", "plot": "Sandu Patrascu is an ordinary Romanian citizen, living in a comfortable apartment in Bucharest. He has a good job (in the vehicle registration business), a wife (no-nonsense Olga), a teenage son (computer-obsessed Matei) and a (trained) dog. On the whole, he feels good about himself. One day though, he gets upset by an incident he is the witness of: a violent quarrel taking place on the other side of a female neighbor's door. Worse, Vali, another neighbor, leaves the apartment while Sandu stands in the staircase listening. Even worse, Laura, the young woman he has heard shouting is found murdered. What will Patrascu do under such circumstances ?", "url": "http://subslikescript.com/movie/Un_etaj_mai_jos-4620316"},
{"title": "Un hiver en été (2023) - full transcript", "plot": null, "url": "http://subslikescript.com/movie/Un_hiver_en_t-21906990"},
{"title": "Un étrange voyage (1981) - full transcript", "plot": "A man walks a length of railroad track, looking for his elderly mother whom he believes fell from the train at some point. He brings his daughter along.", "url": "http://subslikescript.com/movie/Un_trange_voyage-81679"},
{"title": "Un crimen común (2020) - full transcript", "plot": "Cecilia is a sociology teacher. One night the son of her maid desperately knocks on the door of her house. She doesn't open. The next day, Kevin's body shows up murdered by the police. Cecilia begins to be haunted by the young man's ghost.", "url": "http://subslikescript.com/movie/Un_crimen_comn-11732324"},
{"title": "Un embrujo (1998) - full transcript", "plot": "The movie takes place in Mexico after the revolution, Eliseo, a young boy falls in love with his school teacher (played by Blanca Guerra) a affair between them occurs, and when it is discovered by the town people she is forced to leave. many years pass and Eliseo now a full grown man still longs the love of his teacher.", "url": "http://subslikescript.com/movie/Un_embrujo-168734"},
{"title": "Umi to yuuhi to kanojo no namida sutoroberi firuzu (2006) - full transcript", "plot": null, "url": "http://subslikescript.com/movie/Umi_to_yuuhi_to_kanojo_no_namida_sutoroberi_firuzu-8462116"},
{"title": "Umbrella Flower (2000) - full transcript", "plot": "An alcoholic civil servant wakes up under a cherry tree in Tokyo next to a bar hostess with whom he's impulsively made a suicide pact. Though he's now changed his mind, he agrees to travel with her to Hokkaido, her preferred site for ending it all. An elegiac road movie of restrained emotion.", "url": "http://subslikescript.com/movie/Umbrella_Flower-261000"},
{"title": "Un monde (2021) - full transcript", "plot": "When Nora witnesses Abel being bullied by other kids, she rushes to protect him. But Abel forces her to remain silent. Caught in a conflict of loyalty, Nora tries to find her place, torn between children's and adult's worlds.", "url": "http://subslikescript.com/movie/Un_monde-11087960"},
{"title": "Un om în loden (1979) - full transcript", "plot": null, "url": "http://subslikescript.com/movie/Un_om_n_loden-137137"},
{"title": "Un petit bout de France (2012) - full transcript", "plot": null, "url": "http://subslikescript.com/movie/Un_petit_bout_de_France-3113196"},
{"title": "Un homme heureux (2023) - full transcript", "plot": "As Jean, a conservative, campaigns to be reelected mayor of a small town in northern France, Edith, his spouse of 40 years, tells him a secret he can no longer repress: in his heart, he is - and always has been - a man. At first J...", "url": "http://subslikescript.com/movie/Un_homme_heureux-23740404"}
]